'use strict'

var REST = 
[
	{	
		task : 
`1. Что такое REST? `,

		solution : 
`Representational State Transfer — «передача состояния представления»  — 
архитектурный стиль взаимодействия компонентов распределённого приложения в сети. 

Компоненты в REST взаимодействуют наподобие взаимодействия клиентов и серверов.

Вызов удалённой процедуры может представлять собой обычный HTTP-запрос (обычно «GET» или «POST»; такой запрос называют «REST-запрос»), 
а необходимые данные передаются в качестве параметров запроса.

Для веб-служб, построенных с учётом REST (то есть не нарушающих накладываемых им ограничений), применяют термин «RESTful».

В отличие от веб-сервисов (веб-служб) на основе SOAP, не существует «официального» стандарта для RESTful веб-API. 
Дело в том, что REST является архитектурным стилем, в то время как SOAP является протоколом. 
Несмотря на то, что REST не является стандартом сам по себе, 
большинство RESTful-реализаций используют стандарты, такие как HTTP, URL, JSON и XML.`
	}
]