'use strict'	  
var solid_1 = 
[
	{	
		task : "What is SOLID?", 			
		
		solution : "SOLID - это пять основных принципов объектно-ориентированного программирования и проектирования.\n\n" +
		"S\tSRP (The Single Responsibility Principle)\n" +
		"\tПринцип единственной ответственности.\n" +
		"\tСуществует лишь одна причина, приводящая к появлению класса.\n\n" +

		"O\tOCP (The Open Closed Principle)\n" +
		"\tПринцип открытости/закрытости.\n" +
		"\t«программные сущности … должны быть открыты для расширения,\n" +
		"\tно закрыты для модификации.»\n\n" +
		
		"L\tLSP (The Liskov Substitution Principle)\n" +  
		"\tПринцип подстановки Барбары Лисков.\n" +
		"\t«объекты в программе должны быть заменяемыми\n" + 
		"\tна экземпляры их подтипов\n" +
		"\tбез изменения правильности выполнения программы.»\n\n" +

		"I\tISP (The Interface Segregation Principle)\n" +
		"\tПринцип разделения интерфейса.\n" +
		"\t«много интерфейсов,\n" + 
		"\tспециально предназначенных для клиентов, лучше,\n" +
		"\tчем один интерфейс общего назначения.»\n\n" +

		"D\tDIP (The Dependency Inversion Principle)\n" +
		"\tПринцип инверсии зависимостей.\n" +
		"\t«Зависимость на Абстракциях.\n" +
		"\tНет зависимости на что-то конкретное.»"
	}

	// {
	// 	task : "", 			
		
	// 	solution : ""
	// }
];